import os

class Config:
    MODEL_PATH = './best_model1.h5'  # 모델 파일 경로
    UPLOAD_FOLDER = './static/uploads'
    ALLOWED_EXTENSIONS = {'png', 'jpg', 'jpeg', 'gif'}
    SPECIFIC_IMAGE_SIZE = (1080, 1080)  # 요구되는 정확한 이미지 크기 (너비, 높이)
    SECRET_KEY = 'super secret key'

    MYSQL_HOST = 'localhost'
    MYSQL_USER = 'root'
    MYSQL_PASSWORD = '1234'
    MYSQL_DB = 'food'
    MYSQL_CURSORCLASS = 'DictCursor'

    category = {0: ['가지나물무침', '가지나물무침'], 1: ['간장게장', '간장게장'], 2: ['갈비탕', '갈비탕'], 3: ['갈치조림', '갈치조림'],
                4: ['감자조림', '감자조림'], 5: ['감자탕', '감자탕'], 6: ['경단', '경단'], 7: ['계란국', '계란국'],
                8: ['계란프라이', '계란프라이'], 9: ['고등어구이', '고등어구이'], 10: ['고등어조림', '고등어조림'],
                11: ['고사리나물', '고사리나물'], 12: ['곰탕', '곰탕'], 13: ['김밥', '김밥'], 14: ['김치볶음밥', '김치볶음밥'],
                15: ['김치전', '김치전'], 16: ['김치찌개', '김치찌개'], 17: ['깍두기', '깍두기'], 18: ['깻잎장아찌', '깻잎장아찌'],
                19: ['꼬막찜', '꼬막찜'], 20: ['꽁치조림', '꽁치조림'], 21: ['꽈리고추무침', '꽈리고추무침'], 22: ['꿀떡', '꿀떡'],
                23: ['나박김치', '나박김치'], 24: ['누룽지', '누룽지'], 25: ['닭볶음탕', '닭볶음탕'], 26: ['도라지무침', '도라지무침'],
                27: ['도토리묵', '도토리묵'], 28: ['동그랑땡', '동그랑땡'], 29: ['된장찌개', '된장찌개'], 30: ['두부조림', '두부조림'],
                31: ['땅콩조림', '땅콩조림'], 32: ['떡갈비', '떡갈비'], 33: ['떡국', '떡국'], 34: ['떡볶이', '떡볶이'],
                35: ['라면', '라면'], 36: ['메추리알장조림', '메추리알장조림'], 37: ['무국', '무국'],
                38: ['미역줄기볶음', '미역줄기볶음'], 39: ['배추김치', '배추김치'], 40: ['백김치', '백김치'], 41: ['보쌈', '보쌈'],
                42: ['볶음밥', '볶음밥'], 43: ['부추김치', '부추김치'], 44: ['북엇국', '북엇국'], 45: ['불고기', '불고기'],
                46: ['비빔밥', '비빔밥'], 47: ['삼겹살', '삼겹살'], 48: ['삼계탕', '삼계탕'], 49: ['송편', '송편'],
                50: ['순두부찌개', '순두부찌개'], 51: ['시금치나물', '시금치나물'], 52: ['시래기된장국', '시래기된장국'],
                53: ['애호박볶음', '애호박볶음'], 54: ['약과', '약과'], 55: ['양념게장', '양념게장'], 56: ['어묵볶음', '어묵볶음'],
                57: ['연근조림', '연근조림'], 58: ['열무김치', '열무김치'], 59: ['오이소박이', '오이소박이'], 60: ['육개장', '육개장'],
                61: ['잡곡밥', '잡곡밥'], 62: ['잡채', '잡채'], 63: ['장조림', '장조림'], 64: ['총각김치', '총각김치'],
                65: ['추어탕', '추어탕'], 66: ['콩나물국', '콩나물국'], 67: ['콩나물무침', '콩나물무침'], 68: ['콩자반', '콩자반'],
                69: ['호박전', '호박전']}
    RDA = [2500, 320, 52.5, 44.5, 25, 2000, 300, 315, 700, 12]
    RDA2 = {
        'kcal': 2500,
        'carbohydrate': 320,
        'protein': 52.5,
        'fat': 44.5,
        'sugars': 25,
        'salt': 2000,
        'coles': 300,
        'mag': 315,
        'calcium': 700,
        'iron': 12
    }
    nutrient_map = {
        'kcal': '칼로리',
        'carbohydrate': '탄수화물',
        'protein': '단백질',
        'fat': '지방',
        'sugars': '설탕',
        'salt': '나트륨',
        'coles': '콜레스테롤',
        'mag': '마그네슘',
        'calcium': '칼슘',
        'iron': '철'
    }
